Tekla.Structures.DrawingInternal.GenericDelegateFake`1
Implements ICDelegate so that every method returns according to Tekla.Structures.RemotingHelper.IReturnStrategy
Can be used in unit testing to mock Tekla Structures behavior, by setting
a ICDelegate instance using Tekla.Structures.DrawingInternal.CDelegateSetter.

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.GetDrawingViewVisibilityFilterValue(System.Int32,System.String@)
Fake method that returns true.
drawingViewId: The drawing view id.
drawingViewVisibilityFilterValue: The drawing view filter value.
Returns: true

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.GetRaiseReadWindowsNamesByViewIds(System.Int32,System.Int32)
Fake method that returns true.
modelViewId: The model view id.
drawingViewId: The drawing view id.
Returns: true

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportLevelMarkHandler(Tekla.Structures.DrawingInternal.dotGrLevelMark_t@)
Fake Level Mark Attributes Hander
pLevelMark: .Net Level Mark
Returns: No Return
Throws System.NotImplementedException: Not Implemented

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportLevelMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t@)
Fake Level Mark Attributes Hander
pLevelMarkAttributes: .Net Level Mark Atributes
Returns: No Return
Throws System.NotImplementedException: Not Implemented

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportArePoursShownInDrawing


Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportGetColorIndexFromARGB(Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Fake method that returns 0.
ARGB: Color structure defining alpha, red, green, blue values.
Returns: 0.

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportGetARGBFromColorIndex(System.Int32,Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Fake method that returns true.
ColorIndex: TS globally unique color index.
ARGB: Color structure defining alpha, red, green, blue values.
Returns: true.

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportIsStandardColor(System.Int32)
Fake method that returns true.
ColorIndex: TS globally unique color index.
Returns: true.

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportGetColorIndexFromSaveFormat(System.String)
Fake method that returns 0.
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: 0.

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportGetSaveFormatFromColorIndex(System.Int32,System.String@)
Fake method that returns true.
ColorIndex: TS globally unique color index.
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: true.

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportGetAllColorPaletteFiles(Tekla.Structures.DrawingInternal.dotClientId_t)
Fake method that returns true.
DotClientId: client id
Returns: true

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportShowColorPalette(System.Int32,System.IntPtr)
Fake method that returns true.
color: The initial color
hWndOwner: The window handle of the owner window
Returns: true

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportShowColorPaletteForHatchBackground(System.Int32,System.IntPtr)
Fake method that returns true.
color: The initial color
hWndOwner: The window handle of the owner window
Returns: true

Tekla.Structures.DrawingInternal.GenericDelegateFake`1.ExportGetDrawingToObjectMapping(Tekla.Structures.DrawingInternal.dotClientId_t)
Fake method that returns true.
DotClientId: Client id
Returns: true